<template>
  <div>
    <h1>В данном приложении было реализовано:</h1>
    <h3 style="margin-top: 20px">Библиотека UI компонентов</h3>
    <h3>Модальное окно</h3>
    <h3>Работа с сервером. Получаем посты. Axios</h3>
    <h3>Выпадающий список. Сортировка постов</h3>
    <h3>Анимации transition group</h3>
    <h3>Поиск постов. Фильтрация</h3>
    <h3>Пагинация. Постраничный вывод</h3>
    <h3>Динамический биндинг классов и стилей</h3>
    <h3>Динамическая пагинация. Бесконечная лента. Intersection API</h3>
    <h3>Refs. Доступ к DOM элементу</h3>
    <h3>VUE-ROUTER. Постраничная навигация</h3>
    <h3>Создание собственных директив V-INTERSACTION и V-FOCUS</h3>
    <h3>Mixins. Примеси</h3>
    <h3>Vuex. Глобальное состояние приложения</h3>
    <h3>Composition API</h3>
  </div>
</template>

<script>
export default {

}
</script>

<style lang="scss" scoped>

</style>